MusicApp/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 5]]
---

<% @band.albums.each do |album| %>