MusicApp/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "studio", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Coolthing"], ["year", 111111], ["studio", true], ["created_at", "2018-09-13 22:47:07.971335"], ["updated_at", "2018-09-13 22:47:07.971335"], ["band_id", 5]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "year" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "Album1WWW"], ["year", 1112], ["updated_at", "2018-09-14 00:23:58.057073"], ["id", 11]]
---
  def update
    @album = Album.find_by(id: params[:id])

    if @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 6]]
---
  def destroy
    @album = Album.find_by(id: params[:id])
    @album.destroy