MusicApp/app/controllers/bands_controller.rb

  def update
    @band = Band.find_by(id: params[:id])

    if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "newname!"], ["updated_at", "2018-09-13 21:41:15.019414"], ["id", 3]]

  def destroy
    @band = Band.find_by(id: params[:id])
    @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]