MusicApp/app/views/albums/_form.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---

  <% album_band = Band.find_by(id: params[:band_id]) %>

SELECT "bands".* FROM "bands"
---
      <option></option>
      <% Band.all.each do |band| %>