MusicApp/app/views/albums/new.html.erb

<% band = Band.find_by(id: params[:band_id]) %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]