MusicApp/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---

<% band = Band.find_by(id: @album.band_id) %>